Tekla Open API Reference for Tekla Structures 2025
CustomObservableCollection<T> Constructor
Overload List
Name | Description
CustomObservableCollection<T>()
 CustomObservableCollection constructor.
CustomObservableCollection<T>(IEnumerable<T>)
 CustomObservableCollection constructor.
CustomObservableCollection<T>(List<T>)
 CustomObservableCollection constructor.
Top
See Also
Reference
CustomObservableCollection<T> Class
Tekla.Structures.Dialog.UIControls Namespace